```diff
  # aws_ecr_lifecycle_policy.rule[4] will be created
  + resource "aws_ecr_lifecycle_policy" "rule" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "dev",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "tariff-trade-tariff-search-query-parser"
    }

  # aws_ecr_repository.docker[4] will be created
  + resource "aws_ecr_repository" "docker" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "tariff-trade-tariff-search-query-parser"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_iam_policy.ecr_policy must be replaced
-/+ resource "aws_iam_policy" "ecr_policy" {
      ~ arn         = "arn:aws:iam::777015734912:policy/ecr-policy" -> (known after apply)
      ~ description = "A test policy" -> "ECR policy for managing project deployment ECR images" # forces replacement
      ~ id          = "arn:aws:iam::777015734912:policy/ecr-policy" -> (known after apply)
        name        = "ecr-policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:TagResource",
                          + "ecr:StartLifecyclePolicyPreview",
                          + "ecr:StartImageScan",
                            "ecr:PutLifecyclePolicy",
                            "ecr:PutImageTagMutability",
                          - "ecr:DescribeImageScanFindings",
                          - "ecr:StartImageScan",
                          - "ecr:GetLifecyclePolicyPreview",
                          - "ecr:GetDownloadUrlForLayer",
                            "ecr:PutImageScanningConfiguration",
                          + "ecr:PutImage",
                            "ecr:ListTagsForResource",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:UploadLayerPart",
                            "ecr:ListImages",
                          - "ecr:PutImage",
                          - "ecr:BatchGetImage",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:DescribeImages",
                          - "ecr:TagResource",
                          - "ecr:DescribeRepositories",
                          - "ecr:StartLifecyclePolicyPreview",
                          - "ecr:BatchCheckLayerAvailability",
                          + "ecr:InitiateLayerUpload",
                            "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                            "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                        # (3 unchanged elements hidden)
                    },
                  ~ {
                      ~ Action   = [
                          + "ecr:PutRegistryPolicy",
                            "ecr:GetRegistryPolicy",
                          - "ecr:DescribeRegistry",
                            "ecr:GetAuthorizationToken",
                          - "ecr:PutRegistryPolicy",
                          + "ecr:DescribeRegistry",
                        ]
                      ~ Resource = "*" -> "arn:aws:ecr:eu-west-2:777015734912:repository/*"
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
      ~ policy_id   = "ANPA3J2N7GKAJH6S3LTXB" -> (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_iam_user_policy_attachment.ci-ecr must be replaced
-/+ resource "aws_iam_user_policy_attachment" "ci-ecr" {
      ~ id         = "trade-tariff-ci-account-20210915111358562800000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::777015734912:policy/ecr-policy" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 0 to change, 2 to destroy.
```